In [1]:
import numpy as np

In [9]:
import pandas as pd

In [10]:
data = np.random.randn(4, 3)

In [11]:
data

array([[ 0.03162809, -1.75309224,  0.04691181],
       [-1.09910079,  0.03411264,  0.13257483],
       [-1.02637013, -0.36964893, -0.57955556],
       [-0.54098982,  0.32712727,  0.10873455]])

In [12]:
dataFrame = pd.DataFrame(data)

In [13]:
dataFrame

          0         1         2
0  0.031628 -1.753092  0.046912
1 -1.099101  0.034113  0.132575
2 -1.026370 -0.369649 -0.579556
3 -0.540990  0.327127  0.108735

In [14]:
dataFrame[0]

0    0.031628
1   -1.099101
2   -1.026370
3   -0.540990
Name: 0, dtype: float64

kolon geldi

In [16]:
yeniDataFrame = pd.DataFrame(data, index=["Nurseli", "Zeynep", "Mert", "İsa"], columns = ["Maaş","Yaş","Saat"])

In [17]:
yeniDataFrame

             Maaş       Yaş      Saat
Nurseli  0.031628 -1.753092  0.046912
Zeynep  -1.099101  0.034113  0.132575
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990  0.327127  0.108735

In [18]:
yeniDataFrame["Yaş"]

Nurseli   -1.753092
Zeynep     0.034113
Mert      -0.369649
İsa        0.327127
Name: Yaş, dtype: float64

In [20]:
yeniDataFrame[["Maaş", "Saat"]]

             Maaş      Saat
Nurseli  0.031628  0.046912
Zeynep  -1.099101  0.132575
Mert    -1.026370 -0.579556
İsa     -0.540990  0.108735

In [21]:
yeniDataFrame.loc["Nurseli"]

Maaş    0.031628
Yaş    -1.753092
Saat    0.046912
Name: Nurseli, dtype: float64

row'u seçmek için

In [22]:
yeniDataFrame.iloc[1]

Maaş   -1.099101
Yaş     0.034113
Saat    0.132575
Name: Zeynep, dtype: float64

row da index bazlı lokasyon

In [23]:
yeniDataFrame

             Maaş       Yaş      Saat
Nurseli  0.031628 -1.753092  0.046912
Zeynep  -1.099101  0.034113  0.132575
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990  0.327127  0.108735

In [24]:
yeniDataFrame["Emeklilik Yaşı"] = yeniDataFrame["Yaş"] + yeniDataFrame["Saat"]

In [25]:
yeniDataFrame

             Maaş       Yaş      Saat  Emeklilik Yaşı
Nurseli  0.031628 -1.753092  0.046912       -1.706180
Zeynep  -1.099101  0.034113  0.132575        0.166687
Mert    -1.026370 -0.369649 -0.579556       -0.949204
İsa     -0.540990  0.327127  0.108735        0.435862

In [27]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1)

             Maaş       Yaş      Saat
Nurseli  0.031628 -1.753092  0.046912
Zeynep  -1.099101  0.034113  0.132575
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990  0.327127  0.108735

axis = 1 column, axis = 0 row   default olarak axis = 0 zaten yazmaya gerek yok

In [28]:
yeniDataFrame.drop("İsa", axis = 0)

             Maaş       Yaş      Saat  Emeklilik Yaşı
Nurseli  0.031628 -1.753092  0.046912       -1.706180
Zeynep  -1.099101  0.034113  0.132575        0.166687
Mert    -1.026370 -0.369649 -0.579556       -0.949204

In [29]:
yeniDataFrame

             Maaş       Yaş      Saat  Emeklilik Yaşı
Nurseli  0.031628 -1.753092  0.046912       -1.706180
Zeynep  -1.099101  0.034113  0.132575        0.166687
Mert    -1.026370 -0.369649 -0.579556       -0.949204
İsa     -0.540990  0.327127  0.108735        0.435862

güncellenmedi. DateFrame de  komple değiştirmek için ayrıca belirtmek gerekir

In [30]:
yeniDataFrame.drop("Emeklilik Yaşı", axis = 1, inplace = True)

In [31]:
yeniDataFrame

             Maaş       Yaş      Saat
Nurseli  0.031628 -1.753092  0.046912
Zeynep  -1.099101  0.034113  0.132575
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990  0.327127  0.108735

In [32]:
yeniDataFrame.loc["Nurseli"]

Maaş    0.031628
Yaş    -1.753092
Saat    0.046912
Name: Nurseli, dtype: float64

In [33]:
yeniDataFrame.loc["Nurseli"]["Yaş"]

-1.7530922361623729

In [34]:
yeniDataFrame

             Maaş       Yaş      Saat
Nurseli  0.031628 -1.753092  0.046912
Zeynep  -1.099101  0.034113  0.132575
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990  0.327127  0.108735

In [36]:
booleanFrame = yeniDataFrame < 0

In [37]:
yeniDataFrame[booleanFrame]

             Maaş       Yaş      Saat
Nurseli       NaN -1.753092       NaN
Zeynep  -1.099101       NaN       NaN
Mert    -1.026370 -0.369649 -0.579556
İsa     -0.540990       NaN       NaN

sadece 0 dan küçük olanların değerlerini gösterir

In [39]:
yeniDataFrame[yeniDataFrame["Yaş"] > 0]

            Maaş       Yaş      Saat
Zeynep -1.099101  0.034113  0.132575
İsa    -0.540990  0.327127  0.108735

In [40]:
yeniDataFrame.reset_index()

     index      Maaş       Yaş      Saat
0  Nurseli  0.031628 -1.753092  0.046912
1   Zeynep -1.099101  0.034113  0.132575
2     Mert -1.026370 -0.369649 -0.579556
3      İsa -0.540990  0.327127  0.108735

In [43]:
newIndexList = ["Nur","Zey","Mer","İsa"]

In [45]:
yeniDataFrame ["New Index"] = newIndexList

In [46]:
yeniDataFrame.set_index("New Index")

               Maaş       Yaş      Saat
New Index
Nur        0.031628 -1.753092  0.046912
Zey       -1.099101  0.034113  0.132575
Mer       -1.026370 -0.369649 -0.579556
İsa       -0.540990  0.327127  0.108735

In [47]:
yeniDataFrame

             Maaş       Yaş      Saat New Index
Nurseli  0.031628 -1.753092  0.046912       Nur
Zeynep  -1.099101  0.034113  0.132575       Zey
Mert    -1.026370 -0.369649 -0.579556       Mer
İsa     -0.540990  0.327127  0.108735       İsa

In [48]:
yeniDataFrame.set_index("New Index", inplace = True)

In [49]:
yeniDataFrame.loc["Nur"]

Maaş    0.031628
Yaş    -1.753092
Saat    0.046912
Name: Nur, dtype: float64

In [52]:
ilkİndeksler = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park"]

In [53]:
icİndeksler =["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [65]:
birleşmişİndeks = list(zip(ilkİndeksler, icİndeksler))

In [66]:
birleşmişİndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [67]:
birleşmişİndeks = pd.MultiIndex.from_tuples(birleşmikİndeks)

In [68]:
birleşmişİndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [69]:
benimCizgiFilmListem = [[40, "A"], [30, "B"], [10, "C"],[9, "D"], [10, "E"], [11, "F"]]

In [70]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [71]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index = birleşmişİndeks, columns=["Yaş", "Meslek"])

In [72]:
cizgiFilmDataFrame

                   Yaş Meslek
Simpson    Homer    40      A
           Bart     30      B
           Marge    10      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [75]:
cizgiFilmDataFrame.loc["Simpson"].loc["Bart"]

Yaş       30
Meslek     B
Name: Bart, dtype: object

In [76]:
cizgiFilmDataFrame.index.names = ["Film Adı", "İsim"]

In [77]:
cizgiFilmDataFrame

                   Yaş Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     30      B
           Marge    10      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F